---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModelWarn
source: html/b6c3355c-12e3-d5b0-5a8c-6f4a805da0fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModelWarn Property

A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingPadByElementsInMainModelWarn { get; }
```